6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-06 Fri 15:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Compilation for Java</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Bender" />
<link href="./assets/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./assets/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Compilation for Java</h1>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Java ~&gt; Vapor</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>m c1 ... cq</code>
<ul class="org-ul">
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">clss[m c1 ... cq, ∅, ∅] -&gt; (layouts, vmts)   
meth[m c1 ... cq, layouts, vmts] -&gt; (ms)
---------------------------------------------------------------------
[m c1 ... cq ] -&gt; &lt;vmts&gt;
                  &lt;ms(Main)&gt;
                  &lt;ms&gt;
</pre>
</div></li>
</ul></li>
<li><code>new id()</code>
<ul class="org-ul">
<li>First approximation 
<ul class="org-ul">
<li>assume we have no inheritance</li>
<li><p>
e.g.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">foo</span>;       
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">bar</span>;
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">baz</span>;

  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">m</span><span style="color: #6c3163;">(){</span>      
    <span style="color: #3a81c3; font-weight: bold;">return</span> foo;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">support field refs</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Main</span> <span style="color: #3a81c3;">{</span> 
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">main</span><span style="color: #6c3163;">(</span> ... <span style="color: #6c3163;">){</span> 
    <span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #715ab1;">a</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">A</span><span style="color: #2d9574;">()</span>; 
    a.m<span style="color: #2d9574;">()</span>;       <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">support method calls</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div></li>
</ul></li>
<li>Member variables/fields
<ul class="org-ul">
<li><code>|fields| * 4</code></li>
<li><p>
eg
</p>
<ul class="org-ul">
<li>intantiate class <code>A</code> with 3 fields</li>
<li>call the method <code>m</code></li>
<li>write the result into the second field</li>
<li>read the third field</li>
</ul>
<div class="org-src-container">

<pre class="src src-vapor">// instantiate:
r1 = HeapAllocZ(16)

// our initial convention
[r1] = :A.m

... 

// method call:
// deref instance
r2 = [r1]
// deref method offset (how do we know this?)
r3 = [r2 + 0]
r4 = call r3()

// field write
[r1 + 8] = r3

// field read
r5 = [r1 + 12]
</pre>
</div></li>
</ul></li>
<li>Virtual Method Tables
<ul class="org-ul">
<li>Why do we need VMTs?</li>
<li><p>
e.g.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #3a81c3;">{</span> 
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">m</span><span style="color: #6c3163;">(){</span> ... <span style="color: #6c3163;">}</span> 
<span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">B</span> <span style="color: #3a81c3; font-weight: bold;">extends</span> <span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #3a81c3;">{</span> 
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">m</span><span style="color: #6c3163;">(){</span> ... <span style="color: #6c3163;">}</span> 
<span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">P</span> <span style="color: #3a81c3;">{</span> 
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">n</span><span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #715ab1;">aOrB</span><span style="color: #6c3163;">){</span> 
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">which implementation of m?</span>
    aOrB.m<span style="color: #2d9574;">()</span>; 
  <span style="color: #6c3163;">}</span> 
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-vapor">const vmt_A
  :A.m

const vmt_B
  :B.m
</pre>
</div></li>
<li>Two conventions
<ol class="org-ol">
<li>table labels</li>
<li>method labels</li>
</ol></li>
<li>inherited methods
<ul class="org-ul">
<li><p>
e.g. 
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #3a81c3;">{</span> 
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">m</span><span style="color: #6c3163;">(){</span> ... <span style="color: #6c3163;">}</span> 
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">l</span><span style="color: #6c3163;">(){</span> ... <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">B</span> <span style="color: #3a81c3; font-weight: bold;">extends</span> <span style="color: #ba2f59; font-weight: bold;">A</span> <span style="color: #3a81c3;">{</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">m</span><span style="color: #6c3163;">(){</span> ... <span style="color: #6c3163;">}</span> <span style="color: #3a81c3;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-vapor">const vmt_A
  :A.m
  :A.l

const vmt_B
  ??
</pre>
</div></li>
</ul></li>
<li>Third convention, method definition occurs in defined order</li>
<li>Lookup may be slow, when/how can we optimize?</li>
</ul></li>
<li>Final form
<ul class="org-ul">
<li><p>
eg
</p>
<ul class="org-ul">
<li>assuming public access to member variables</li>
<li>intantiate class <code>A</code> with 3 fields</li>
<li>call the second method (no params)</li>
<li>write the result into the second field</li>
<li>read the third field</li>
</ul>
<div class="org-src-container">

<pre class="src src-vapor">// instantiate: 
r1 = HeapAllocZ(16) // why 16?

// attach vmt label
[r1] = :vmt_A

...

// method call: 
// deref instance 
r2 = [r1] 

// deref vmt + offset 
r3 = [r2 + 0] 
r4 = call r3()

// field write of m() return
[r1 + 8] = r4

// field read for some other purpose
r5 = [r1 + 12]
</pre>
</div></li>
</ul></li>
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">size = size(layouts(id))
-------------------------------
expr[new id(), i, layouts, vmts] -&gt;
   (r&lt;i&gt; = HeapAllocZ(&lt;size&gt;)
    [r&lt;i&gt;] = :vmt_&lt;id&gt;,       i+1 )
</pre>
</div></li>
</ul></li>
<li><code>e.id(...)</code>
<ul class="org-ul">
<li>Where do we get the method from?</li>
<li>Why does the factorial example check null?</li>
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">expr[e, i+1, layouts, vmts] -&gt; (code1, i1)
expr[e1, i1, layouts, vmts] -&gt; (code2, i2)
...
expr[en, in, layouts, vmts] -&gt; (coden+1, in+1)
offset = offset(vmts(classof(e)), id)
--------------------------------------------
expr[e.id( e1, ..., en ), i, layouts, vmts] -&gt;
  ( &lt;code1&gt;
    &lt;code2&gt;
    ...
    &lt;coden&gt;
    r&lt;i&gt;_vmt = [r&lt;i+1&gt;]
    r&lt;i&gt;_mcall = [r&lt;i&gt;_vmt + offset]
    r&lt;i&gt; = call ri_mcall(r&lt;i+1&gt; r&lt;i1&gt; ... r&lt;in-1&gt;), in+1 )
</pre>
</div></li>
</ul></li>
<li><code>class id { t1 id1 ... tn idn }</code>
<ul class="org-ul">
<li>Fields, see <code>new id()</code> above</li>
<li>Methods
<ul class="org-ul">
<li>for each method create a label in the const table</li>
<li>table label at first entry</li>
</ul></li>
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">vmts' = vmts ∪ { const vmt_&lt;id&gt; :&lt;id&gt;.m1 ... :&lt;id&gt;.mp }
layouts' = layouts ∪ { (id1, ... idn ) }
clss[rest, layouts', vmts'] -&gt; (layouts'', vmts'')
---------------------------------------------------------------
clss[class id { t1 id1 ... tn idn m1 ... mp } rest, layouts, vmts] 
  -&gt; (layouts'', vmts'')
</pre>
</div></li>
</ul></li>
<li><code>class id1 extends id2 { ... }</code>
<ul class="org-ul">
<li>We must take the parent class layout into account, here <code>combine</code></li>
<li>Single pass can get the layout from the parent if it is defined before or
after the child class</li>
<li>Rules
<ul class="org-ul">
<li><p>
If the parent class is defined before
</p>
<div class="org-src-container">

<pre class="src src-rule">layouts(id2) =/= bot 
layouts' = layouts ∪ { combine(layouts(id2), id1, ... idn ) }
vmts' = vmts ∪ { const vmt_&lt;id&gt; :&lt;id&gt;.&lt;m1&gt; ... :&lt;id&gt;.&lt;mp&gt; }

clss[rest, layouts', vmts'] -&gt; (layouts'', vmts'')
---------------------------------------------------------------
clss[class id1 extends id2 { t1 id1 ... tn idn m1 ... mp }  rest, layouts, vmts] 
  -&gt; (layouts'', vmts'')
</pre>
</div></li>
<li><p>
If the parent class is defined after
</p>
<div class="org-src-container">

<pre class="src src-rule">vmts' = vmts ∪ { const vmt_&lt;id&gt; :&lt;id&gt;.&lt;m1&gt; ... :&lt;id&gt;.&lt;mp&gt; }
clss[rest, layouts, vmts'] -&gt; (layouts', vmts'')
layouts'' = layouts' ∪ { combine(layouts(id2), id1, ... idn ) }
----------------------------------------------------------------------------
clss[class id1 extends id2 { t1 id1 ... tn idn m1 ... mp }  rest, layouts, vmts] 
  -&gt; (layouts'', vmts'')
</pre>
</div></li>
<li>Missing layout details?
<ul class="org-ul">
<li>fields with the same name?</li>
<li>field placement?</li>
<li>parent field references?</li>
</ul></li>
</ul></li>
</ul></li>
<li><code>t id( t1 id1 ... tn idn ){ ... }</code>
<ul class="org-ul">
<li><p>
Class Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">meth[id, m1, i+1, layouts, vmts] -&gt; (m1code, i1)
...
meth[id, mn, in, layouts, vmts] -&gt; (mn+1code, in+1)
--------------------------------------------------------
meth[class id ... { ...; m1 ... mn }, i, layouts, vmts] -&gt;
  ({ m1 -&gt; m1code, ..., mn -&gt; mn+1code})
</pre>
</div></li>
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">stmt[s1, i+1, layouts, vmts] -&gt; (code1, i1)
stmt[s1, i1, layouts, vmts] -&gt; (code2, i2)
stmt[s1, in, layouts, vmts] -&gt; (coden+1, in+1)
expr[e, in+1, layouts, vmts] -&gt; (codee, ie)
------------------------------------------------------------
meth[C, t id( t1 id1 ... tn idn ){ ... s1; .... sn; return e }, 
  i, 
  layouts, 
  vmts] -&gt;
  ( func &lt;C&gt;_&lt;id&gt;(this id1 ... idn): 
      &lt;code1&gt;
      &lt;code1&gt;
      ...
      &lt;coden&gt;
      &lt;codee&gt;
      ret i&lt;in+1&gt;, ie )
</pre>
</div></li>
</ul></li>
<li><code>if (e) s1 else s2</code>
<ul class="org-ul">
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">expr[e, i+1, layouts, vmts] -&gt; (code1, i')
stmt[s1, i', layouts, vmts] -&gt; (code2, i'')
stmt[s2, i'', layouts, vmts] -&gt; (code3, i''')
-------------------------------
stmt[if (e) s1 else s2, i, layouts, vmts] -&gt;
  ( &lt;code1&gt;
    ifz r&lt;i+1&gt; goto if&lt;i&gt;_else:
      &lt;code2&gt;
      goto if&lt;i&gt;_end:
    if&lt;i&gt;_else: 
      &lt;code3&gt;
    if&lt;i&gt;_end:,  i''')
</pre>
</div></li>
<li>What happened to the <code>r&lt;i&gt; = ...</code></li>
<li>Boolean representation 
<ul class="org-ul">
<li><code>!e</code>
<ul class="org-ul">
<li><code>!false = 1-0 = 1</code>, <code>!true = 1-1 = 0</code>,</li>
</ul></li>
<li><code>e1 &amp;&amp; e2</code>
<ul class="org-ul">
<li><code>true &amp;&amp; false = 1 * 0 = 0</code>, <code>true &amp;&amp; true = 1 * 1 = 1</code></li>
</ul></li>
<li><code>e1 || e2</code>
<ul class="org-ul">
<li>??</li>
</ul></li>
</ul></li>
<li>short circuiting?</li>
</ul></li>
<li><code>while (e) s</code>
<ul class="org-ul">
<li><p>
Rule
</p>
<div class="org-src-container">

<pre class="src src-rule">expr[e, i+1, lay¯outs, vmts] -&gt; (code1, i')
stmt[s, i', layouts, vmts] -&gt; (code2, i'')
-------------------------------------------
stmt[while (e) s , i, layots, vmts] -&gt;
  ( while&lt;i&gt;_cond: 
      &lt;code1&gt;
    ifz r&lt;i+1&gt; goto while&lt;i&gt;_end:
      &lt;code2&gt;
      goto while&lt;i&gt;_cond
    while&lt;i&gt;_end:,  i'')
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Bender</p>
<p class="date">Created: 2016-05-06 Fri 15:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
